app/views/events/_event_form.html.erb

         <div id="attendees">
        <% if @event.contacts.length > 0 %>
---
SELECT "contacts"."id" FROM "contacts" INNER JOIN "contacts_events" ON "contacts"."id" = "contacts_events"."contact_id" WHERE "contacts_events"."event_id" = ?  [["event_id", 1]]