app/views/events/index.html.erb

              <td><%= link_to event.contacts_count, event_contacts_path(event) %></td>
              <td><%= event.contacts_events.sum(:guests) %></td>
---
SELECT "events".* FROM "events" WHERE (admin_level <= 2)
SELECT SUM("contacts_events"."guests") FROM "contacts_events" WHERE "contacts_events"."event_id" = ?  [["event_id", 1]]