app/views/events/show.html.erb

  <label>Date:</label> <%= @event.date_human %><br>
  <label>Student Count:</label> <%= @event.contacts.count %><br>
  <label>Guest Count:</label> <%= @event.contacts_events.sum(:guests) %><br>
  <label>Attendees:</label><br>
    <% @event.contacts.each do |contact| %>
---
SELECT "contacts".* FROM "contacts" INNER JOIN "contacts_events" ON "contacts"."id" = "contacts_events"."contact_id" WHERE "contacts_events"."event_id" = ?  [["event_id", 1]]
SELECT COUNT(*) FROM "contacts" INNER JOIN "contacts_events" ON "contacts"."id" = "contacts_events"."contact_id" WHERE "contacts_events"."event_id" = ?  [["event_id", 1]]
SELECT COUNT(*) FROM "contacts" INNER JOIN "contacts_events" ON "contacts"."id" = "contacts_events"."contact_id" WHERE "contacts_events"."event_id" = ?  [["event_id", 3]]
SELECT SUM("contacts_events"."guests") FROM "contacts_events" WHERE "contacts_events"."event_id" = ?  [["event_id", 1]]