app/views/events/show.html.erb

SELECT "contacts".* FROM "contacts" INNER JOIN "contacts_events" ON "contacts"."id" = "contacts_events"."contact_id" WHERE "contacts_events"."event_id" = ?  [["event_id", 3]]
---
              <p class="card-category">
                <% @event.contacts.each do |contact| %>