app/views/contacts/_contact_form.html.erb

  <%= f.label "user_id", class: "lb-lg" %><br>
  <%= f.collection_select :user_id, User.all.access(@user_admin_level), :id, :name, {}, {class: "custom-select"} %><br><br>
---
SELECT "users".* FROM "users"