app/views/contacts/index.html.erb

SELECT "contacts".* FROM "contacts" WHERE (admin_level <= 0) AND (updated_at >= '2019-04-09')
---
              <datalist id="contacts_autocomplete">
              <% Contact.same_level(@user_admin_level).each do |c| %>

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
            <datalist id="staff_autocomplete">
            <% User.same_level(@user_admin_level).each do |u| %>