app/views/contacts/new.html.erb

SELECT "users".* FROM "users"
---
  <%= f.label "Staff" %>
  <%= f.collection_select :user_id, User.all, :id, :name %><br>