app/views/contacts/show.html.erb

        <label>Birthday:</label> <%= birthday_human @contact || "N/A" %><br>
        <label>Attendance Count:</label> <%= @contact.events.count %><br>
---
SELECT "events".* FROM "events" INNER JOIN "contacts_events" ON "events"."id" = "contacts_events"."event_id" WHERE "contacts_events"."contact_id" = ?  [["contact_id", 1]]
SELECT COUNT(*) FROM "events" INNER JOIN "contacts_events" ON "events"."id" = "contacts_events"."event_id" WHERE "contacts_events"."contact_id" = ?  [["contact_id", 1]]