app/controllers/application_controller.rb

  def current_user
    if !session[:user_id] then nil else User.find(session[:user_id]) end
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]