app/controllers/contacts_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "contacts".* FROM "contacts" INNER JOIN "contacts_events" ON "contacts"."id" = "contacts_events"."contact_id" WHERE "contacts_events"."event_id" = ?  [["event_id", 1]]
---
  def index
    if params[:event_id]
      @event = Event.find(params[:event_id])
      @contacts = @event.contacts
    else
      @contacts = Contact.all.access(current_user.admin_level)

INSERT INTO "contacts" ("name", "email", "gender", "user_id", "phone_number", "school_status", "messenger_company", "messenger_id", "major", "country", "birthday", "admin_level", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "contacts" SET "birthday" = ? WHERE "contacts"."id" = ?  [["birthday", "0001-05-05"], ["id", 2]]
---
  def create
    @contact = Contact.new(contact_params)
    @contact.admin_level=(@contact.user)
    if !!Event.exists?(id: params[:contact][:event_id]) then @contact.events << Event.find_by(id: params[:contact][:event_id].to_i) end
    if @contact.save then redirect_to contact_path(@contact) else render :new end

UPDATE "contacts" SET "messenger_id" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["messenger_id", "fake"], ["updated_at", "2019-07-02 23:09:46.957369"], ["id", 1]]
UPDATE "contacts" SET "major" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["major", "animal science2"], ["updated_at", "2019-07-02 22:53:06.333622"], ["id", 1]]
---
  def update
    @contact.update(contact_params)
    @contact.admin_level=(@contact.user)
    if @contact.save then redirect_to contact_path(@contact) else render :edit end

DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 1]]
---
  def destroy
    @contact.delete

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_contact
    @contact = Contact.find(params[:id])