app/controllers/contacts_controller.rb

  def update
    @user = User.find_by(id: contact_params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]