app/controllers/events_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" INNER JOIN "contacts_events" ON "events"."id" = "contacts_events"."event_id" WHERE "contacts_events"."contact_id" = ?  [["contact_id", 1]]
---
  def index
    if params[:contact_id]
      @contact = Contact.find(params[:contact_id])
      @events = @contact.events
    else
      @events = Event.all.access(current_user.admin_level)

INSERT INTO "events" ("name", "date", "admin_level") VALUES (?, ?, ?)  [["name", "friday bible study"], ["date", "2019-07-02"], ["admin_level", 0]]
---
  def create
    @event = Event.new(event_params)
    @event.contacts = Contact.add_contacts(params[:event][:contact_ids], @event)
    @event.admin_level = current_user.admin_level
    if @event.save then redirect_to event_path(@event) else render :new end

UPDATE "events" SET "name" = ? WHERE "events"."id" = ?  [["name", "friday bible study"], ["id", 1]]
---
  def update
    @event.update(name: event_params[:name], date: event_params[:date])

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
  def destroy
    @event.delete