app/controllers/sessions_controller.rb

INSERT INTO "users" ("email", "password_digest", "google_token") VALUES (?, ?, ?)
UPDATE "users" SET "password_digest" = ?, "google_token" = ? WHERE "users"."id" = ?
---
  def googleAuth
    access_token = request.env["omniauth.auth"]
    @user = User.from_omniauth(access_token)
    @user.save