app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest") VALUES (?, ?)  [["email", "macmoore@ucdavis.edu"], ["password_digest", "$2a$12$H88yXIgGQKFKYevq8gl4YunL/wVTo3pHG3ZGguCPZfAgK.Z3B92Qy"]]
---
  def create
    @user = User.new(email: user_params[:email], password: user_params[:password])
    @user.admin_level=(user_params[:admin_level])
    if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    @user.delete

UPDATE "users" SET "admin_level" = ? WHERE "users"."id" = ?  [["admin_level", 0], ["id", 2]]
UPDATE "users" SET "admin_level" = ? WHERE "users"."id" = ?  [["admin_level", 1], ["id", 2]]
UPDATE "users" SET "admin_level" = ? WHERE "users"."id" = ?  [["admin_level", 2], ["id", 2]]
---
  def enter_code
    if params[:user][:admin_level].to_i == 2
      @user.update(admin_level: ENV['ADMIN'])
    elsif params[:user][:admin_level].to_i == 1
      @user.update(admin_level: ENV['IGSM'])
    else
      @user.update(admin_level: 0)