app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "admin_level" = ? WHERE "users"."id" = ?  [["admin_level", "igsm"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    @user.admin_level = params[:user][:admin_level]
    if @user.save