app/models/contact.rb

  def self.add_contacts(params, event, user)
    if !params[:contact_ids].empty?
      ContactsEvent.where(event_id: event.id).delete_all
      params[:contact_ids].reject!(&:empty?)
      params[:contact_ids].collect do |c_id|
        if Contact.find_by(id: c_id).admin_level <= user.admin_level
          ContactsEvent.find_or_create_by(contact_id: c_id.to_i, event_id: event.id)
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "events" ("name", "date") VALUES (?, ?)  [["name", "not secret"], ["date", "2019-07-06"]]
INSERT INTO "contacts_events" ("contact_id", "event_id") VALUES (?, ?)  [["contact_id", 1], ["event_id", 1]]

  def event_id=(id)
    if !id.empty?
---
SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."id" ASC LIMIT ?  [["LIMIT", 1]]