app/models/event.rb

  def contacts_count
    self.contacts.count
---
SELECT COUNT(*) FROM "contacts" INNER JOIN "contacts_events" ON "contacts"."id" = "contacts_events"."contact_id" WHERE "contacts_events"."event_id" = ?  [["event_id", 1]]