app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "macmoore@ucdavis.edu"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? AND "users"."id" != ? LIMIT ?  [["email", "mackenzie.moore@gpmail.org"], ["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$K./7Y38VwNKprSLsnG6Gj.g0iwi0BLyxCys4TJfcFgEO3A8dV4RFu"], ["id", 1]]
---
  def self.from_omniauth(auth)
    @user = User.where(email: auth.info.email).first_or_initialize
    @user.admin_level=(ENV['IGSM']) if @user.email.include?("@gpmail.org")
    @user.password = SecureRandom.hex
    @user.save